# Set Operations on DataFrames

To start with, let's explain what "set" operations are.  When we say "set" here, we aren't talking about the `set` data type in Python.  We're talking about **set algebra**.  https://en.wikipedia.org/wiki/Algebra_of_sets

**Operations**
* UNION
* INTERSECTION
* MINUS / EXCEPT
* COMPLIMENT

**Relations**
* EQUALITY
* INCLUSION

## OPERATIONS

In [1]:
import pandas as pd
family = pd.DataFrame([['Paul','M'],['Anny','F'],['Sarahlynn','F'],['Jim','M']], columns=['Name','Gender'])
kirkwood = pd.DataFrame([['Paul','M'],['Anny','F'],['Sarahlynn','F'],['Rob','M']], columns=['Name','Gender'])

family.set_index('Name', inplace=True)
kirkwood.set_index('Name', inplace=True)

In [2]:
family

          Gender
Name
Paul           M
Anny           F
Sarahlynn      F
Jim            M

In [3]:
kirkwood

          Gender
Name
Paul           M
Anny           F
Sarahlynn      F
Rob            M

In [4]:
# UNION
pd.concat([family, kirkwood], join='outer', axis=1, sort=False)

          Gender Gender
Name
Paul           M      M
Anny           F      F
Sarahlynn      F      F
Jim            M    NaN
Rob          NaN      M

In [5]:
# INTERSECTION
pd.concat([family, kirkwood], join='inner', axis=1, sort=False)

          Gender Gender
Name
Paul           M      M
Anny           F      F
Sarahlynn      F      F

In [6]:
# MINUS
family.loc[family.index.difference(kirkwood.index)]

     Gender
Name
Jim       M

In [7]:
family.loc[family.index.difference(kirkwood.index)]

     Gender
Name
Jim       M

**COMPLIMENT** isn't really a valuable concept with data frames because there isn't the idea of an "entire universe of possible values"

## RELATIONS

In [8]:
import pandas as pd
family = pd.DataFrame([['Paul','M'],['Anny','F'],['Sarahlynn','F'],['Jim','M']], columns=['Name','Gender'])
kirkwood_family = pd.DataFrame([['Paul','M'],['Anny','F'],['Sarahlynn','F']], columns=['Name','Gender'])

family.set_index('Name', inplace=True)
kirkwood_family.set_index('Name', inplace=True)

In [9]:
family

          Gender
Name
Paul           M
Anny           F
Sarahlynn      F
Jim            M

In [10]:
kirkwood_family

          Gender
Name
Paul           M
Anny           F
Sarahlynn      F

In [11]:
# Test for equality
family.index.equals(kirkwood_family.index)

False

In [12]:
# Test for inclusion
len(kirkwood_family.index.difference(family.index)) == 0

True

In [13]:
import pandas as pd
family = pd.DataFrame([['Paul','M'],['Anny','F'],['Sarahlynn','F'],['Jim','M']], columns=['Name','Gender'])
kirkwood_family = pd.DataFrame([['PAUL','M'],['ANNY','F'],['SARAHLYNN','F']], columns=['Name','Gender'])

In [14]:
family['n'] = family['Name'].str.lower()

In [15]:
kirkwood_family['n'] = kirkwood_family['Name'].str.lower()

In [16]:
family.set_index('n', inplace=True)
kirkwood_family.set_index('n', inplace=True)

In [17]:
family

                Name Gender
n
paul            Paul      M
anny            Anny      F
sarahlynn  Sarahlynn      F
jim              Jim      M

In [18]:
len(kirkwood_family.index.difference(family.index)) == 0

True

In [19]:
kirkwood_family.index.difference(family.index)

Index([], dtype='object', name='n')